RhinoInside.Revit API Documentation
ColorWithTransparencyConverter.ToColorWithTransparency Method
 Converts the specified Color to an equivalent Autodesk.Revit.DB.Color.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.ColorWithTransparency ToColorWithTransparency(
	this Color value
)
@staticmethod
def ToColorWithTransparency(
	value: Color
) -> Autodesk.Revit.DB.ColorWithTransparency
Parameters
value
Type: System.Drawing.Color
A value to convert.
Return Value
Type: Autodesk.Revit.DB.ColorWithTransparency
A Autodesk.Revit.DB.ColorWithTransparency that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ColorWithTransparencyConverter Class
RhinoInside.Revit.Convert.System.Drawing Namespace